app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses" WHERE (concept LIKE '%Hamburguesa%' AND category_id = '1')  ORDER BY date DESC
SELECT "expenses".* FROM "expenses"  ORDER BY date DESC
---
  def index
    if params[:concept]
      @expenses = Expense.where(["concept LIKE ?", "%#{params[:concept]}%"]).order("date DESC")
    else
      @expenses = Expense.order("date DESC")